cats99/app/controllers/cat_rental_requests_controller.rb

def index
  @cat_request = CatRentalRequest.all
---
SELECT "cat_rental_requests".* FROM "cat_rental_requests"

def create
  @cat_rental_request = CatRentalRequest.new(cat_rental_request_params)
  if @cat_rental_request.save
---
INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["cat_id", 4], ["start_date", "2018-11-13"], ["end_date", "2018-11-16"], ["created_at", "2018-11-14 01:21:40.441288"], ["updated_at", "2018-11-14 01:21:40.441288"]]