cats99/app/controllers/cats_controller.rb

  def create
    @cat = Cat.new(cat_params)

    if @cat.save
---
INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def edit
    @cat = Cat.find(params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

  def update
    @cat = Cat.find(params[:id])
    if @cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "cats" SET "color" = ?, "description" = ?, "updated_at" = ? WHERE "cats"."id" = ?  [["color", "orange"], ["description", "  fourth cat upate"], ["updated_at", "2018-11-13 23:28:01.324060"], ["id", 5]]