cats99/app/views/cat_rental_requests/new.html.erb

SELECT "cats".* FROM "cats"
---
    <select name= "cat_rental_request[cat_id]">
      <% Cat.all.each do |cat| %>