cats99/app/views/cats/show.html.erb

SELECT "cat_rental_requests"."start_date", "cat_rental_requests"."end_date" FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = ? ORDER BY "cat_rental_requests"."start_date" ASC  [["cat_id", 4]]
---
<ul>
  <% Cat.find(@cat.id).rental_requests.order(:start_date).pluck(:start_date,:end_date).each do |req| %>